@file:Suppress("UNUSED_PARAMETER")

package lesson2

import java.io.File


/**
 * Получение наибольшей прибыли (она же -- поиск максимального подмассива)
 * Простая
 *
 * Во входном файле с именем inputName перечислены цены на акции компании в различные (возрастающие) моменты времени
 * (каждая цена идёт с новой строки). Цена -- это целое положительное число. Пример:
 *
 * 201
 * 196
 * 190
 * 198
 * 187
 * 194
 * 193
 * 185
 *
 * Выбрать два момента времени, первый из них для покупки акций, а второй для продажи, с тем, чтобы разница
 * между ценой продажи и ценой покупки была максимально большой. Второй момент должен быть раньше первого.
 * Вернуть пару из двух моментов.
 * Каждый момент обозначается целым числом -- номер строки во входном файле, нумерация с единицы.
 * Например, для приведённого выше файла результат должен быть Pair(3, 4)
 *
 * В случае обнаружения неверного формата файла бросить любое исключение.
 * Ресурсоемкость: O(n)
 * Трудоемкость: O(n)
 */
fun optimizeBuyAndSell(inputName: String): Pair<Int, Int> {
    val input = File(inputName).readLines()
    val buffer = mutableListOf<Int>()
    var max = Int.MIN_VALUE
    var min = 0
    var result = 0 to 0

    for (line in input) buffer.add(line.toInt())

    for (i in 0 until buffer.size) {
        if (buffer[i] - buffer[min] > max) {
            max = buffer[i] - buffer[min]
            result = min + 1 to i + 1
        }

        if (buffer[i] < buffer[min]) {
            min = i
        }
    }

    return result
}

/**
 * Задача Иосифа Флафия.
 * Простая
 *
 * Образовав круг, стоят menNumber человек, пронумерованных от 1 до menNumber.
 *
 * 1 2 3
 * 8   4
 * 7 6 5
 *
 * Мы считаем от 1 до choiceInterval (например, до 5), начиная с 1-го человека по кругу.
 * Человек, на котором остановился счёт, выбывает.
 *
 * 1 2 3
 * 8   4
 * 7 6 х
 *
 * Далее счёт продолжается со следующего человека, также от 1 до choiceInterval.
 * Выбывшие при счёте пропускаются, и человек, на котором остановился счёт, выбывает.
 *
 * 1 х 3
 * 8   4
 * 7 6 Х
 *
 * Процедура повторяется, пока не останется один человек. Требуется вернуть его номер (в данном случае 3).
 *
 * 1 Х 3
 * х   4
 * 7 6 Х
 *
 * 1 Х 3
 * Х   4
 * х 6 Х
 *
 * х Х 3
 * Х   4
 * Х 6 Х
 *
 * Х Х 3
 * Х   х
 * Х 6 Х
 *
 * Х Х 3
 * Х   Х
 * Х х Х
 *
 * Общий комментарий: решение из Википедии для этой задачи принимается,
 * но приветствуется попытка решить её самостоятельно.
 * Ресурсоемкость: O(1)
 * Трудоемкость: O(n), n-menNumber
 */

fun josephTask(menNumber: Int, choiceInterval: Int): Int {
    var res = 0

    for (i in 1..menNumber)
        res = (res + choiceInterval) % i

    return res + 1
}

/**
 * Наибольшая общая подстрока.
 * Средняя
 *
 * Дано две строки, например ОБСЕРВАТОРИЯ и КОНСЕРВАТОРЫ.
 * Найти их самую длинную общую подстроку -- в примере это СЕРВАТОР.
 * Если общих подстрок нет, вернуть пустую строку.
 * При сравнении подстрок, регистр символов *имеет* значение.
 * Если имеется несколько самых длинных общих подстрок одной длины,
 * вернуть ту из них, которая встречается раньше в строке first.
 *
 * Ресурсоемкость: O(n*m), где n - first.length ,m - second.length
 * Трудоемкость: O(n*m), где n - first.length ,m - second.length
 */
fun longestCommonSubstring(first: String, second: String): String {
    if (first.isEmpty() || second.isEmpty()) return ""

    var max = 0
    var endNumber = 0
    val counts = Array(first.length + 1) { IntArray(second.length + 1) }

    for (i in 1..first.length) {
        for (j in 1..second.length) {
            if (first[i - 1] == second[j - 1]) {
                counts[i][j] = counts[i - 1][j - 1] + 1
            }

            if (counts[i][j] > max) {
                endNumber = i
                max = counts[i][j]
            }
        }
    }

    return first.substring(endNumber - max, endNumber)
}

/**
 * Число простых чисел в интервале
 * Простая
 *
 * Рассчитать количество простых чисел в интервале от 1 до limit (включительно).
 * Если limit <= 1, вернуть результат 0.
 *
 * Справка: простым считается число, которое делится нацело только на 1 и на себя.
 * Единица простым числом не считается.
 *
 * Трудоемкость: O(n * log(log(n)))
 * Ресурсоемкость: O(n)
 */
fun calcPrimesNumber(limit: Int): Int {
    var result = 0
    val prime = BooleanArray(limit + 1) { true }

    for (i in 2 until prime.size) {
        if (prime[i]) {
            var j = 2
            while (i * j < prime.size) {
                prime[i * j] = false
                ++j
            }
        }
    }

    for (i in 2 until prime.size)
        if (prime[i]) result++
    return result
}


/**
 * Балда
 * Сложная
 *
 * В файле с именем inputName задана матрица из букв в следующем формате
 * (отдельные буквы в ряду разделены пробелами):
 *
 * И Т Ы Н
 * К Р А Н
 * А К В А
 *
 * В аргументе words содержится множество слов для поиска, например,
 * ТРАВА, КРАН, АКВА, НАРТЫ, РАК.
 *
 * Попытаться найти каждое из слов в матрице букв, используя правила игры БАЛДА,
 * и вернуть множество найденных слов. В данном случае:
 * ТРАВА, КРАН, АКВА, НАРТЫ
 *
 * И т Ы Н     И т ы Н
 * К р а Н     К р а н
 * А К в а     А К В А
 *
 * Все слова и буквы -- русские или английские, прописные.
 * В файле буквы разделены пробелами, строки -- переносами строк.
 * Остальные символы ни в файле, ни в словах не допускаются.
 */
fun baldaSearcher(inputName: String, words: Set<String>): Set<String> {
    TODO()
}